<div style="color:white;
           display:fill;
           border-radius:5px;
           background-color:#5642C5;
           font-size:200%;
           font-family:Arial;letter-spacing:0.5px">

<p width = 20%, style="padding: 10px;
              color:white;">
SQL: Introduction and Basic Querying
</p>
</div>

Data Science Cohort Live NYC Feb 2022
<p>Phase 1: Topic 4</p>
<br>
<br>

<div align = "right">
<img src="Images/flatiron-school-logo.png" align = "right" width="200"/>
</div>

#### Databases

Data for organizations: typically stored in a **database**.

- Database: organized collection of structured information.
- Typically fairly large and hosted by dedicated servers.
- A database controlled by a database management system (DBMS).

<div align = "center">
    <center><img src="Images/dbms.jpg" align = "center" width="500"/></center>
</div>

With DBMS: store, update, share, and access specific subset of database. 

- CSVs and JSONs are often extracts of some data from a database.

#### The relational database
<br>
<div align = "center">
    <center><img src="Images/tables_relational.png" align = "center" width="700"/></center>
</div>

Tables are linked together by relationships.

  Why relational databases are great and what came before (first 5 modules): <br>
  https://mariadb.com/kb/en/database-theory/

Common DBMS for Relational Databases
<br>
<div>
    <center><img src="Images/postgresql.png"  width="200"/></center>
    <center><img src="Images/mysql.png"  width="300"/></center>
    <center><img src="Images/SQLite-Python.jpg" align = "center" width="200"/></center>
</div>
      
</div>

#### Structured Query Language

- De-facto king of languages for interacting with relational databases and their DBMS.
- Invaluable for you in almost any data role. 
- You will use it often to get the data that you need for your analyses.

Let's get into using SQL!

In [1]:
# import sqlite
import sqlite3
import pandas as pd

Interacting with a sqlite database.
- Connect to database 
- Create interface to ask database for stuff
- After connection established:
    1. Execute query 
    2. Fetch result 
- Close connection to database when done with queries.

Commands:
- conn = sqlite3.connect(database)
- cursor_obj = conn.cursor()
- Query database/get result:
    1. cursor.execute(SQL_query)
    2. cursor.fetchall()
- conn.close()

This opens a connection to the flights database and creates cursor object.

In [2]:
con = sqlite3.connect('data/flights.db')
cursor_obj = con.cursor()

See tables in the sqlite database via command line.

In [3]:
%%bash 

sqlite3 data/flights.db
.tables

airlines  airports  routes

Get schema of sqlite database: whole or single table

In [3]:
%%bash
sqlite3 data/flights.db
.schema

CREATE TABLE airports (
[index] INTEGER,
  [id] TEXT,
  [name] TEXT,
  [city] TEXT,
  [country] TEXT,
  [code] TEXT,
  [icao] TEXT,
  [latitude] TEXT,
  [longitude] TEXT,
  [altitude] TEXT,
  [offset] TEXT,
  [dst] TEXT,
  [timezone] TEXT
);
CREATE INDEX ix_airports_index ON airports ([index]);
CREATE TABLE airlines (
[index] INTEGER,
  [id] TEXT,
  [name] TEXT,
  [alias] TEXT,
  [iata] TEXT,
  [icao] TEXT,
  [callsign] TEXT,
  [country] TEXT,
  [active] TEXT
);
CREATE INDEX ix_airlines_index ON airlines ([index]);
CREATE TABLE routes (
[index] INTEGER,
  [airline] TEXT,
  [airline_id] TEXT,
  [source] TEXT,
  [source_id] TEXT,
  [dest] TEXT,
  [dest_id] TEXT,
  [codeshare] TEXT,
  [stops] TEXT,
  [equipment] TEXT
);
CREATE INDEX ix_routes_index ON routes ([index]);

#### SELECT statement

Let's explore the following clauses and structure:

```sql
SELECT columns ( * for all fields)
FROM table
WHERE condition
ORDER BY columns
LIMIT number (limits to first n entries of table)
```

Execute SQL command:

In [6]:
query = cursor_obj.execute("""
SELECT * 
FROM airports 
LIMIT 1
""")

In [9]:
query.fetchall()

[(0,
  '1',
  'Goroka',
  'Goroka',
  'Papua New Guinea',
  'GKA',
  'AYGA',
  '-6.081689',
  '145.391881',
  '5282',
  '10',
  'U',
  'Pacific/Port_Moresby')]

**Exercise**

Use the cursor object to execute and retrieve the results of the following query:

Retrieve all fields for the first five entries of the database and store in a list of tuples.

In [4]:
# EXECUTE THAT QUERY

query = cursor_obj.execute("""
SELECT * 
FROM airports 
LIMIT 5
""")

In [9]:
# FETCH DEM RESULTS

query.fetchall()

[(0,
  '1',
  'Goroka',
  'Goroka',
  'Papua New Guinea',
  'GKA',
  'AYGA',
  '-6.081689',
  '145.391881',
  '5282',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (1,
  '2',
  'Madang',
  'Madang',
  'Papua New Guinea',
  'MAG',
  'AYMD',
  '-5.207083',
  '145.7887',
  '20',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (2,
  '3',
  'Mount Hagen',
  'Mount Hagen',
  'Papua New Guinea',
  'HGU',
  'AYMH',
  '-5.826789',
  '144.295861',
  '5388',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (3,
  '4',
  'Nadzab',
  'Nadzab',
  'Papua New Guinea',
  'LAE',
  'AYNZ',
  '-6.569828',
  '146.726242',
  '239',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (4,
  '5',
  'Port Moresby Jacksons Intl',
  'Port Moresby',
  'Papua New Guinea',
  'POM',
  'AYPY',
  '-9.443383',
  '147.22005',
  '146',
  '10',
  'U',
  'Pacific/Port_Moresby')]

- execute, fetchall protocol gets data in python list form.
- can issue commands to create things in database.

Now close the connection to the database when you are done.

In [11]:
con.close()
con

When *just retrieving* tabular data:

- Pandas has pd.read_sql(query, database_connection) command.

In [12]:
airports_query = \
"""
SELECT *
FROM airports
"""

Make sure you have a connection to the sql database open.

In [13]:
con = sqlite3.connect('data/flights.db')

In [14]:
# requires reference to open database connection
query_result_df = pd.read_sql(airports_query, con)
query_result_df.head()

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
0,0,1,Goroka,Goroka,Papua New Guinea,GKA,AYGA,-6.081689,145.391881,5282,10,U,Pacific/Port_Moresby
1,1,2,Madang,Madang,Papua New Guinea,MAG,AYMD,-5.207083,145.7887,20,10,U,Pacific/Port_Moresby
2,2,3,Mount Hagen,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826789,144.295861,5388,10,U,Pacific/Port_Moresby
3,3,4,Nadzab,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569828,146.726242,239,10,U,Pacific/Port_Moresby
4,4,5,Port Moresby Jacksons Intl,Port Moresby,Papua New Guinea,POM,AYPY,-9.443383,147.22005,146,10,U,Pacific/Port_Moresby

Selecting particular columns:

In [15]:
query_result_df = pd.read_sql("""

SELECT city, country
FROM airports

""", con)

query_result_df.head(5)

           city           country
0        Goroka  Papua New Guinea
1        Madang  Papua New Guinea
2   Mount Hagen  Papua New Guinea
3        Nadzab  Papua New Guinea
4  Port Moresby  Papua New Guinea

#### DISTINCT
- Select only unique results of query.

In [11]:
query_result = pd.read_sql("""

SELECT DISTINCT country
FROM airports

""", con)

query_result.head()

            country
0  Papua New Guinea
1         Greenland
2           Iceland
3            Canada
4           Algeria

**Exercise**

Get a list of the distinct cities in the database and store it as a pandas Series. What is the number of cities represented in this database?

In [6]:
# Do it.
query_result = pd.read_sql("""
SELECT DISTINCT city
FROM airports

""", con)
   
query_result.head()

           city
0        Goroka
1        Madang
2   Mount Hagen
3        Nadzab
4  Port Moresby

In [8]:
query_result.shape

(6977, 1)

In [7]:
len(query_result)

6977

In [26]:
query_series = query_result['city']

In [27]:
query_series.shape

(6977,)

**Exercise**

Get the cities for each airport in the database and store it as a pandas Series. 

Then get me the number of airports in each city and the number of unique cities. You can use Pandas functions for this.

In [14]:
cities = pd.read_sql("""
SELECT city, name
FROM airports

""", con)

cities["city"].value_counts()
cities.groupby('city').count()['name'].sort_values(ascending = False)

city
London            21
New York          13
Hong Kong         12
Berlin            10
Paris             10
                  ..
Oneonta            1
Ononge             1
Onslow             1
Opolu              1
108 Mile Ranch     1
Name: name, Length: 6977, dtype: int64

#### AS modifier

`AS`: renaming a column in the query and returned result.

In [17]:
sql_query = pd.read_sql("""

SELECT city "Airport_City", 
       country "Airport_Country"
FROM airports

""", con)

sql_query.head()

   Airport_City   Airport_Country
0        Goroka  Papua New Guinea
1        Madang  Papua New Guinea
2   Mount Hagen  Papua New Guinea
3        Nadzab  Papua New Guinea
4  Port Moresby  Papua New Guinea

Some SQL dialects do not require the AS statement:

In [15]:
sql_query = pd.read_sql("""

SELECT city "Airport City", 
       country "Airport Country"
FROM airports

""", con)

sql_query.head()

   Airport City   Airport Country
0        Goroka  Papua New Guinea
1        Madang  Papua New Guinea
2   Mount Hagen  Papua New Guinea
3        Nadzab  Papua New Guinea
4  Port Moresby  Papua New Guinea

#### Functions
Can use predefined functions in SELECT statements:
<br>
<br>
SELECT FUNCTION(columns)
<br>
FROM table

Applies function to the each column and spits out new table.

Functions can be: 
- Transformations on columns:
    - Convert each element in a string column to upper case.
- Aggregation:
    - statistic on each field in a table 
    - e.g. max, min, mean, sum, etc.

#### Transformation

In [18]:
sql_query_df = pd.read_sql("""

SELECT UPPER(name),
       LENGTH(name) 
       
FROM airports

""", con)

sql_query_df.head()

                  UPPER(name)  LENGTH(name)
0                      GOROKA             6
1                      MADANG             6
2                 MOUNT HAGEN            11
3                      NADZAB             6
4  PORT MORESBY JACKSONS INTL            26

But thats a little ugly. What can we do to make this nicer?

**Exercise**

Perform the same query with these derived fields named in a better way.

In [21]:
sql_query_df = pd.read_sql("""

SELECT UPPER (name) as Airport_Names,
    LENGTH(name) as Length
    FROM airports


""", con)

sql_query_df.head()

                Airport_Names  Length
0                      GOROKA       6
1                      MADANG       6
2                 MOUNT HAGEN      11
3                      NADZAB       6
4  PORT MORESBY JACKSONS INTL      26

#### Aggregation
- MAX()
- MIN()
- SUM()
- AVG()
- COUNT()

Get count of entries in table:

In [33]:
sql_query_df = pd.read_sql("""

SELECT COUNT(*) AS count
FROM airports


""", con)

sql_query_df

   count
0   8107

Get count of non-missing entries in a given field:


SELECT COUNT(field_name)
FROM table

In [17]:
sql_query_df = pd.read_sql("""

SELECT COUNT(code) as code_count
FROM airports


""", con)

sql_query_df

   code_count
0        5880

Distinct countries in country field of airports table:

In [26]:

sql_query_df = pd.read_sql("""

SELECT COUNT(DISTINCT country) AS country_count
FROM airports


""", con)

sql_query_df

   country_count
0            240

Let's take a look at our original table again.

In [27]:
sql_query_df = pd.read_sql("""

SELECT * 
FROM airports
LIMIT 5

""", con)

sql_query_df

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
0,0,1,Goroka,Goroka,Papua New Guinea,GKA,AYGA,-6.081689,145.391881,5282,10,U,Pacific/Port_Moresby
1,1,2,Madang,Madang,Papua New Guinea,MAG,AYMD,-5.207083,145.7887,20,10,U,Pacific/Port_Moresby
2,2,3,Mount Hagen,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826789,144.295861,5388,10,U,Pacific/Port_Moresby
3,3,4,Nadzab,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569828,146.726242,239,10,U,Pacific/Port_Moresby
4,4,5,Port Moresby Jacksons Intl,Port Moresby,Papua New Guinea,POM,AYPY,-9.443383,147.22005,146,10,U,Pacific/Port_Moresby

Get maximum altitude in dataset along with corresponding airport.

In [28]:
sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
    MAX(altitude) AS "Altitude (ft)"      
FROM airports

""", con)

sql_query_df

     Airport Name Altitude (ft)
0  Dauphin Barker           999

Something is wrong here. Make sure that your column is the right datatype for the function to avoid unexpected results.

#### `CAST()`

- can enforce typing on a given field.

In [29]:
sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
       MAX(CAST(altitude as int)) AS "Altitude (ft)"
       
FROM airports

""", con)

sql_query_df

      Airport Name  Altitude (ft)
0  Yading Daocheng          14472

Let's get the average altitude:

In [39]:
sql_query_df = pd.read_sql("""

SELECT 
AVG(CAST(altitude as int)) AS "Average Altitude (ft)"
FROM airports

""", con)

sql_query_df

   Average Altitude (ft)
0             933.449365

#### Exercise

Which country has the northern-most airport? Get me the country, airport and altitude.

*Hint*: Look for the highest latitude.

In [39]:
# Help me do this!

pd.read_sql("""

SELECT name,country,
MAX(CAST(latitude as float)) AS "Northern-most - Altitude (ft)"
FROM airports


""", con)

    name country  Northern-most - Altitude (ft)
0  Alert  Canada                      82.517778

So far:
- Selecting fields (columns) and computing functions of them.

Want to: 
- Select records (rows) matching particular criteria.

#### WHERE: Selecting rows via filtering

SELECT columns
<br>
FROM table
<br>
WHERE filter_column meets condition

WHERE statement occurs after main SELECT and FROM clause.

#### Filtering by comparison: WHERE statement

Commonly filter by how column compares to a value.

SELECT column1, column2 
FROM table
WHERE column2 > number

| Operator | Meaning | 
| --- | --- |
| \= | equal |
| \<> | not equal |
| \<  |  less than |
| \> | greater than |
| \<=  | less than or equal to |
| \>= | greater than or equal to |

In [44]:
sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
       CAST(latitude AS int) AS "Airport Latitude",
       CAST(altitude AS int) AS Altitude_ft
       
FROM airports

WHERE Altitude_ft >= 12500

""", con)

sql_query_df

             Airport Name  Airport Latitude  Altitude_ft
0            El Alto Intl               -16        13325
1   Capitan Nicolas Rojas               -19        12913
2                 Juliaca               -15        12552
3           Lhasa-Gonggar                29        13136
4    Qamdo Bangda Airport                30        14219
5               Irkutsk-2                52        13411
6            Yushu Batang                32        13000
7                   Gunsa                32        13780
8        Kangding Airport                30        14042
9      Copacabana Airport               -16        12591
10        Yading Daocheng                29        14472

**Exercise**

Get a airport, their name, city and country for which the airport's altitude is less than sea level.

In [45]:
sql_query_df = pd.read_sql("""
SELECT name, city, country,
CAST(altitude AS int) AS altit

FROM airports

WHERE altit < 0


""", con)

sql_query_df

               name        city        country  altit
0          Schiphol   Amsterdam    Netherlands    -11
1          Lelystad    Lelystad    Netherlands    -13
2         Rotterdam   Rotterdam    Netherlands    -15
3   Alexandria Intl  Alexandria          Egypt     -6
4          En Yahav   Eyn-yahav         Israel   -164
5      I Bar Yehuda     Metzada         Israel  -1266
6             Rasht       Rasht           Iran    -40
7            Ramsar      Ramsar           Iran    -70
8         Astrakhan   Astrakhan         Russia    -65
9       Imperial Co    Imperial  United States    -54
10    El Centro Naf   El Centro  United States    -42
11  Noshahr Airport     Noshahr           Iran    -61
12   Gorgan Airport      Gorgan           Iran    -24

#### NOT operator
- Before condition in `WHERE` clause.
- Negates condition.

In [26]:
sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
       CAST(latitude AS int) AS "Airport Latitude",
       CAST(altitude AS int) AS "Altitude (ft)"
       
FROM airports

WHERE NOT "Altitude (ft)" <= 12500

""", con)

sql_query_df

             Airport Name  Airport Latitude  Altitude (ft)
0            El Alto Intl               -16          13325
1   Capitan Nicolas Rojas               -19          12913
2                 Juliaca               -15          12552
3           Lhasa-Gonggar                29          13136
4    Qamdo Bangda Airport                30          14219
5               Irkutsk-2                52          13411
6            Yushu Batang                32          13000
7                   Gunsa                32          13780
8        Kangding Airport                30          14042
9      Copacabana Airport               -16          12591
10        Yading Daocheng                29          14472

#### Chaining conditionals for filtering
- AND
- OR

#### AND
Get all airports with:
- Altitude > 12500 ft.
- Latitude > 30 degrees

In [47]:
sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
       CAST(latitude AS int) AS "Airport Latitude",
       CAST(altitude AS int) AS "Altitude (ft)"
       
FROM airports

WHERE ("Altitude (ft)" > 12500 )
AND 
("Airport Latitude" > 30)

""", con)

sql_query_df

   Airport Name  Airport Latitude  Altitude (ft)
0     Irkutsk-2                52          13411
1  Yushu Batang                32          13000
2         Gunsa                32          13780

#### OR
Get all airports and their latitude/longitude in Iceland and Denmark.

In [40]:
sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
        country,
       CAST(latitude AS int) AS "Latitude",
       CAST(longitude AS int) AS "Longitude"
       
FROM airports

WHERE (country = "Iceland") OR (country = "Denmark")

""", con)

sql_query_df.head(12)

                      Airport Name  country  Latitude  Longitude
0                         Akureyri  Iceland        65        -18
1                      Egilsstadir  Iceland        65        -14
2                     Hornafjordur  Iceland        64        -15
3                          Husavik  Iceland        65        -17
4                       Isafjordur  Iceland        66        -23
5   Keflavik International Airport  Iceland        63        -22
6                   Patreksfjordur  Iceland        65        -23
7                        Reykjavik  Iceland        64        -21
8                     Siglufjordur  Iceland        66        -18
9                   Vestmannaeyjar  Iceland        63        -20
10                          Aarhus  Denmark        56         10
11                         Billund  Denmark        55          9

#### Exercise

Get the name, lat/long, and altitude for the airport with the maximum altitude considering only airports in Chile and Argentina.

In [49]:
# You can do it!

sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", latitude, longitude, MAX(CAST(altitude as int)) AS altit,

FROM airports

WHERE (country ='Chile') OR (country ='Argentina')

""", con)

sql_query_df

DatabaseError: Execution failed on sql '

SELECT name, latitude, longitude, MAX(CAST( altitude as int)) AS altit,

FROM airports

WHERE (country ='Chile') OR (country ='Argentina')

': near "FROM": syntax error

#### BETWEEN

- Writing multiple inequalities for selecting ranges with `WHERE` statement: annoying.

- BETWEEN ... AND ... solves this problem.

In [50]:
sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
        country,
       CAST(latitude AS int) AS "Latitude",
       CAST(longitude AS int) AS "Longitude"
       
FROM airports

WHERE Latitude BETWEEN 48 AND 51
""", con)

sql_query_df

                        Airport Name        country  Latitude  Longitude
0                Winnipeg St Andrews         Canada        50        -97
1                             Tofino         Canada        49       -125
2                        Baie Comeau         Canada        49        -68
3                         Bagotville         Canada        48        -70
4                     Campbell River         Canada        49       -125
..                               ...            ...       ...        ...
562   Pender Harbour Water Aerodrome         Canada        49       -124
563  Mansons Landing Water Aerodrome         Canada        50       -124
564             Port McNeill Airport         Canada        50       -127
565     Sullivan Bay Water Aerodrome         Canada        50       -126
566             Deer Harbor Seaplane  United States        48       -123

[567 rows x 4 columns]

#### Exercise

Get the name, lat/long, and altitude for the airports with altitude between 0 and 2000 ft considering only airports in Chile and Argentina.

In [52]:
# Yet another time for one of you to reveal your brilliance.

sql_query_df = pd.read_sql("""

SELECT name, latitude, longitude, CAST(altitude as int) as altit

FROM airports

WHERE altitude BETWEEN 0 AND 2000,
WHERE country = 'Chile' and country = 'Argentina'


""", con)

sql_query_df

DatabaseError: Execution failed on sql '

SELECT name, latitude, longitude, CAST(altitude as int) as altit

FROM airports

WHERE altitude BETWEEN 0 AND 2000,
WHERE country = 'Chile' and country = 'Argentina'



': near ",": syntax error

#### IN / NOT IN

- Get all records with a given field taking on a set of values.

SELECT col1, col2 <br> 
FROM table <br>
WHERE col1 IN (col_value1, col_value2, ...) <br>
- E.g.,

    Get name, latitude, longitude for airports in Brazil, Argentina, Chile, and Uruguay

In [53]:
sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
        country,
       CAST(latitude AS float) AS "Latitude",
       CAST(longitude AS float) AS "Longitude"
       
FROM airports

WHERE country IN ("Argentina", "Brazil", "Chile", "Uruguay")
""", con)

sql_query_df

                           Airport Name    country   Latitude  Longitude
0                 Aeropuerto de Rafaela  Argentina -31.282072 -61.501594
1                 Comodoro Pierrestegui  Argentina -31.296944 -57.996631
2                          Gualeguaychu  Argentina -33.010278 -58.613056
3                                 Junin  Argentina -34.545889 -60.930556
4                       General Urquiza  Argentina -31.794778 -60.480361
..                                  ...        ...        ...        ...
362                     Caldera Airport      Chile -27.078052 -70.795305
363        San Pedro de Atacama Airport      Chile -22.918888 -68.162777
364  Aeroporto Estadual Arthur Siqueira     Brazil -22.979167 -46.537500
365                           Americana     Brazil -22.755800 -47.269402
366                            Pampulha     Brazil -19.851700 -43.950800

[367 rows x 4 columns]

##### Filtering rows with null (or no null) values in `WHERE` statement
- IS NULL
- IS NOT NULL

The `IS` operator:
- necessary when working with `NULL` values 
- Cannot use = or <> operators here.

In [38]:
pd.read_sql("""

SELECT name AS "Airport Name",
       code AS "Airport Code"
       
FROM airports

WHERE "Airport Code" IS NULL

""", con)

         Airport Name Airport Code
0         Forestville         None
1        Pitt Meadows         None
2               Blida         None
3           Bou Saada         None
4             Reggane         None
...               ...          ...
2222              Bus         None
2223              Bus         None
2224              Bus         None
2225     Main Station         None
2226  Algerciras Port         None

[2227 rows x 2 columns]

#### Exercise:

Get the count of records with nulls in the code column of the airport table

In [57]:
#### Gimme a hand!

pd.read_sql("""
SELECT COUNT(*)
FROM airports
WHERE code IS NULL 
""", con)

   COUNT(*)
0      2227

#### ORDER BY: Sorting Results

Use `ORDER BY` to identify the column(s) you want to sort on:
- `ASC` for ascending order (default)
- `DESC` for descending order

Get the name and code of airports with:
- top 10 highest altitudes.
- in order of decreasing altitude. 

Then get lowest 10 in increasing order.

In [57]:
pd.read_sql("""

SELECT name AS "Airport Name", 
       code,
       CAST(altitude AS int) AS "Altitude (ft)"
       
FROM airports

ORDER BY "Altitude (ft)" ASC

LIMIT 10
         
""", con)

      Airport Name  code  Altitude (ft)
0     I Bar Yehuda  None          -1266
1         En Yahav  None           -164
2           Ramsar   RZR            -70
3        Astrakhan   ASF            -65
4  Noshahr Airport   NSH            -61
5      Imperial Co   IPL            -54
6    El Centro Naf   NJK            -42
7            Rasht   RAS            -40
8   Gorgan Airport   GBT            -24
9        Rotterdam   RTM            -15

Ordering on multiple columns:

- Can order on one column first and then on another.

E.g., order by:
- decreasing latitudes
- increasing longitudes
- Altitude > 10000 ft.

In [58]:
pd.read_sql("""

SELECT name AS "Airport Name",
       CAST(altitude AS float) AS "Altitude (ft)",
       CAST(latitude AS float) AS "Airport Latitude",
       CAST(longitude AS float) AS "Airport Longitude"    
FROM airports
WHERE "Altitude (ft)" > 10000
ORDER BY "Airport Latitude" DESC, "Airport Longitude" 

""", con)

,Airport Name,Altitude (ft),Airport Latitude,Airport Longitude
0,Summit Camp,10552.0,72.579584,-38.459185
1,Summit Camp,11000.0,72.579187,-38.457200
2,Irkutsk-2,13411.0,52.367800,104.183000
3,Gannan,10466.0,34.490900,102.371900
4,Leh,10682.0,34.135872,77.546514
5,Maiwa,11500.0,33.058044,102.908775
6,Jiuzhaigou Huanglong,11311.0,32.857000,103.683000
7,Yushu Batang,13000.0,32.825000,97.125000
8,Hongyuan Airfield,11500.0,32.800428,102.534785
9,Gunsa,13780.0,32.100270,80.052778
10,Qamdo Bangda Airport,14219.0,30.553600,97.108300
11,Kangding Airport,14042.0,30.157500,101.734722
12,Shigatse Peace Airport,12408.0,29.351667,89.306944
13,Yading Daocheng,14472.0,29.323100,100.053300
14,Lhasa-Gonggar,13136.0,29.297778,90.911944
15,Manang,11000.0,28.633000,84.000000
16,Syangboche,12309.0,27.811187,86.712661
17,Francisco Carle,11034.0,-11.783144,-75.473394
18,Poroy Train Station,11710.0,-13.494400,-72.042100
19,Teniente Alejandro Velasco Astete Intl,10860.0,-13.535722,-71.938781
20,Andahuaylas,11300.0,-13.706408,-73.350378
21,Juliaca,12552.0,-15.467103,-70.158169
22,Copacabana Airport,12591.0,-16.183326,-69.087501
23,El Alto Intl,13325.0,-16.513339,-68.192256
24,Juan Mendoza,12146.0,-17.962589,-67.076236
25,Capitan Nicolas Rojas,12913.0,-19.543069,-65.723706
26,Isla Pescado,12020.0,-20.240932,-67.625380
27,Salar de Uyuni,12000.0,-20.330706,-67.046881
28,Uyuni Airport,11990.0,-20.466667,-66.833333
29,La Quiaca,11414.0,-22.150556,-65.577500

#### CASE WHEN STATEMENTS
Use `CASE` to create new columns using conditional logic:

E.g. partition altitudes into high, medium and low.

- Really useful for partitioning continuous data into groups.

- Also for generating groups that meet certain complex conditions based off of the data

Can be used to devastating effect when combined with groupbys.

In [58]:
sql_query = pd.read_sql("""

SELECT name AS "Airport Name", 
       CAST(altitude AS int) AS "Altitude (ft)",
       CASE 
            WHEN CAST(altitude AS int) > 1000 THEN "High"
            WHEN CAST(altitude AS int) < 100 THEN "Low"
            ELSE "Moderate"
       END 
       
FROM airports
         
LIMIT 20

""", con)

sql_query

,Airport Name,Altitude (ft),"CASE \n WHEN CAST(altitude AS int) > 1000 THEN ""High""\n WHEN CAST(altitude AS int) < 100 THEN ""Low""\n ELSE ""Moderate""\n END"
0,Goroka,5282,High
1,Madang,20,Low
2,Mount Hagen,5388,High
3,Nadzab,239,Moderate
4,Port Moresby Jacksons Intl,146,Moderate
5,Wewak Intl,19,Low
6,Narsarsuaq,112,Moderate
7,Nuuk,283,Moderate
8,Sondre Stromfjord,165,Moderate
9,Thule Air Base,251,Moderate
10,Akureyri,6,Low
11,Egilsstadir,76,Low
12,Hornafjordur,24,Low
13,Husavik,48,Low
14,Isafjordur,8,Low
15,Keflavik International Airport,171,Moderate
16,Patreksfjordur,11,Low
17,Reykjavik,48,Low
18,Siglufjordur,10,Low
19,Vestmannaeyjar,326,Moderate

That was fairly ugly. Lets make this nicer and more informative.

In [67]:
sql_query = pd.read_sql("""

SELECT name AS "Airport Name", 
       CAST(altitude AS int) AS "Altitude (ft)",
       CASE 
            WHEN CAST(altitude AS int) > 1000 THEN "High"
            WHEN CAST(altitude AS int) < 100 THEN "Low"
            ELSE "Moderate"
       END height_category
       
FROM airports
         
LIMIT 20

""", con)

sql_query

                      Airport Name  Altitude (ft) height_category
0                           Goroka           5282            High
1                           Madang             20             Low
2                      Mount Hagen           5388            High
3                           Nadzab            239        Moderate
4       Port Moresby Jacksons Intl            146        Moderate
5                       Wewak Intl             19             Low
6                       Narsarsuaq            112        Moderate
7                             Nuuk            283        Moderate
8                Sondre Stromfjord            165        Moderate
9                   Thule Air Base            251        Moderate
10                        Akureyri              6             Low
11                     Egilsstadir             76             Low
12                    Hornafjordur             24             Low
13                         Husavik             48             Low
14                      Isafjordur              8             Low
15  Keflavik International Airport            171        Moderate
16                  Patreksfjordur             11             Low
17                       Reykjavik             48             Low
18                    Siglufjordur             10             Low
19                  Vestmannaeyjar            326        Moderate

**Exercise**

- Partition the airports into three latitude regions: 

- northern (>= 30), central (30,-30), and southern zones (<=-30).

Get me all the airports in the central and southern zones:
- whose altitude is greater than 3000 ft.
- and anywhere but in Brazil, Venezuela, Papua New Guinea, South Africa and Madagascar

In [78]:
sql_query = pd.read_sql("""

SELECT name AS "Airport Name", country,
CAST (altitude AS INT) AS "Altitude(ft)", 
CAST (latitude AS float) AS "Latitude(deg)",
CASE
    WHEN CAST(latitude AS float) >= 30 THEN "Northern"
    WHEN CAST(latitude AS float) <= -30 THEN "Southern"
    ELSE "CENTRAL"
END "lat_category"

FROM airports
WHERE CAST(altitude as INT)>3000 AND country NOT IN ("Brazil", "Venezuela", "Papua New Guinea", "South Africa", "Madagascar")
AND lat_category IN ("CENTRAL","Southern")
""", con)

sql_query

,Airport Name,country,Altitude(ft),Latitude(deg),lat_category
0,Tiska,Algeria,3176,24.292767,CENTRAL
1,Tamanrasset,Algeria,4518,22.811461,CENTRAL
2,Yakubu Gowon,Nigeria,4232,9.639828,CENTRAL
3,Francistown,Botswana,3283,-21.159597,CENTRAL
4,Jwaneng,Botswana,3900,-24.602333,CENTRAL
...,...,...,...,...,...
332,Yading Daocheng,China,14472,29.323100,CENTRAL
333,Santa Cruz des Quiche Airport,Guatemala,6631,15.012200,CENTRAL
334,Angguruk airstrip,Indonesia,4200,-4.200100,CENTRAL
335,Kabale,Uganda,5850,-1.223333,CENTRAL
336,Bus Stop,Reunion,4000,-21.135518,CENTRAL